import sys
sys.stdin = open("input.txt", 'rt', encoding='UTF8')

pw = {'0':'001101', '1':'010011', '2':'111011', '3':'110001', '4':'100011', '5':'110111', '6':'001011', '7':'111101', '8':'011001', '9':'101111'}
dct = {'0':'0000', '1':'0001', '2':'0010', '3':'0011', '4':'0100', '5':'0101', '6':'0110', '7':'0111', '8':'1000', '9':'1001', 'A':'1010', 'B':'1011', 'C':'1100', 'D':'1101', 'E':'1110', 'F':'1111'}

T = int(input())
for tc in range(1, T+1):
    st1 = input()

    st2 = ''
    for ch in st1:
        st2 += dct[ch]

    ans = []
    i = 0
    while i < len(st2)-5:
        tmp = st2[i:i+6]
        for j in range(10):     # key 개수만큼
            if tmp == pw[str(j)]:
                ans.append(j)
                i += 5
        i += 1

    print(f'#{tc}', *ans)